conorpp/u2f-zero/firmware/lib/efm8_usb/src/efm8_usbdch9.c
  if ((myUsbDevice.setup.wIndex == 0)
      && (myUsbDevice.setup.wValue == 0)
      && (myUsbDevice.setup.wLength == 1)
      && (myUsbDevice.setup.bmRequestType.Direction == USB_SETUP_DIR_IN)
      && (myUsbDevice.setup.bmRequestType.Recipient == USB_SETUP_RECIPIENT_DEVICE))
  {
    if (myUsbDevice.state == USBD_STATE_ADDRESSED)
    {
      EP0_Write(txZero, 1);
      retVal = USB_STATUS_OK;
    }
    else if (myUsbDevice.state == USBD_STATE_CONFIGURED)
    {
      EP0_Write(&myUsbDevice.configurationValue, 1);
      retVal = USB_STATUS_OK;
    }
  }
  return retVal;
}

/***************************************************************************//**
 * @brief       Sends the requested USB Descriptor
 * @details     Supports single or multiple languages (configured by
 *              @ref SLAB_USB_NUM_LANGUAGES).
 * @return      Status of request (type @ref USB_Status_TypeDef)
 * @note        This function takes no parameters, but it uses the setup command
 *              stored in @ref myUsbDevice.setup.
 ******************************************************************************/
static USB_Status_TypeDef GetDescriptor(void)
{
#if (SLAB_USB_NUM_LANGUAGES > 1)
  bool langSupported;
  uint8_t lang;
#endif

  uint8_t index;
  uint16_t length = 0;
  uint8_t *dat;
  USB_Status_TypeDef retVal = USB_STATUS_REQ_ERR;

  if (*((uint8_t *)&myUsbDevice.setup.bmRequestType) ==
      (USB_SETUP_DIR_D2H | USB_SETUP_TYPE_STANDARD | USB_SETUP_RECIPIENT_DEVICE))
  {
    index = myUsbDevice.setup.wValue & 0xFF;

    switch (myUsbDevice.setup.wValue >> 8)
    {
      case USB_DEVICE_DESCRIPTOR:
        if (index != 0)
        {
          break;
        }
        dat = (uint8_t *)myUsbDevice.deviceDescriptor;
        length = myUsbDevice.deviceDescriptor->bLength;
        break;

      case USB_CONFIG_DESCRIPTOR:
        if (index != 0)
        {
          break;
        }
        dat = (uint8_t *)myUsbDevice.configDescriptor;
        length = le16toh(myUsbDevice.configDescriptor->wTotalLength);
        break;

      case USB_STRING_DESCRIPTOR:
  #if (SLAB_USB_NUM_LANGUAGES == 1)

        dat = (uint8_t *)myUsbDevice.stringDescriptors[index];

        // Index 0 is the language string. If SLAB_USB_NUM_LANGUAGES == 1, we
        // know the length will be 4 and the format will be UTF16LE.
        if (index == 0)
        {
          length = 4;
          myUsbDevice.ep0String.encoding.type = USB_STRING_DESCRIPTOR_UTF16LE;
        }
        // Otherwise, verify the language is correct (either the value set as
        // SLAB_USB_LANGUAGE in usbconfig.h, or 0).
        else if ((myUsbDevice.setup.wIndex == 0) || (myUsbDevice.setup.wIndex == SLAB_USB_LANGUAGE))
        {
          // Verify the index is valid
          if (index < myUsbDevice.numberOfStrings)
          {
            length = *(dat + USB_STRING_DESCRIPTOR_LENGTH);
            myUsbDevice.ep0String.encoding.type = *(dat + USB_STRING_DESCRIPTOR_ENCODING);
            dat += USB_STRING_DESCRIPTOR_LENGTH;
            myUsbDevice.ep0String.encoding.init = true;
          }
        }
  #elif (SLAB_USB_NUM_LANGUAGES > 1)

        langSupported = false;

        // Index 0 is the language.
        if (index == 0)
        {
          dat = ((uint8_t *)myUsbDevice.stringDescriptors->languageArray[0][index]);
          length = *((uint8_t *)dat);
          myUsbDevice.ep0String.encoding.type = USB_STRING_DESCRIPTOR_UTF16LE;
        }
        else
        {
          // Otherwise, verify the language is one of the supported languages or 0.
          for (lang = 0; lang < SLAB_USB_NUM_LANGUAGES; lang++)
          {
            if ((myUsbDevice.stringDescriptors->languageIDs[lang] == myUsbDevice.setup.wIndex)
                || (myUsbDevice.stringDescriptors->languageIDs[lang] == 0))
            {
              langSupported = true;
              break;
            }
          }
          if ((langSupported == true) && (index < myUsbDevice.numberOfStrings))
          {
            dat = ((uint8_t *)myUsbDevice.stringDescriptors->languageArray[lang][index]);
            length = *(dat + USB_STRING_DESCRIPTOR_LENGTH);
            myUsbDevice.ep0String.encoding.type = *(dat + USB_STRING_DESCRIPTOR_ENCODING);
            dat += USB_STRING_DESCRIPTOR_LENGTH;

            if (myUsbDevice.ep0String.encoding.type == USB_STRING_DESCRIPTOR_UTF16LE_PACKED)
            {
              myUsbDevice.ep0String.encoding.init = true;
            }
            else
            {
              myUsbDevice.ep0String.encoding.init = false;
            }
          }
        }
  #endif // ( SLAB_USB_NUM_LANGUAGES == 1 )
    }

    // If there is a descriptor to send, get the proper length, then call
    // EP0_Write() to send.
    if (length)
    {
      if (length > myUsbDevice.setup.wLength)
      {
        length = myUsbDevice.setup.wLength;
      }

      EP0_Write(dat, length);

      retVal = USB_STATUS_OK;
    }
  }

  return retVal;
}

/***************************************************************************//**
 * @brief       Sends the current interface alternate setting
 * @details     Sends 0x0000 if alternate interfaces are not supported.
 * @return      Status of request (type @ref USB_Status_TypeDef)
 * @note        This function takes no parameters, but it uses the setup command
 *              stored in @ref myUsbDevice.setup.
 ******************************************************************************/
static USB_Status_TypeDef GetInterface(void)
{
  uint16_t interface = myUsbDevice.setup.wIndex;
  USB_Status_TypeDef retVal = USB_STATUS_REQ_ERR;

  if ((interface < SLAB_USB_NUM_INTERFACES)
      && (myUsbDevice.setup.wLength == 1)
      && (myUsbDevice.setup.wValue == 0)
      && (*((uint8_t *)&myUsbDevice.setup.bmRequestType) ==
          (USB_SETUP_DIR_D2H | USB_SETUP_TYPE_STANDARD | USB_SETUP_RECIPIENT_INTERFACE)))
  {
    if (myUsbDevice.state == USBD_STATE_CONFIGURED)
    {
#if (SLAB_USB_SUPPORT_ALT_INTERFACES)
      // Return the alternate setting for the specified interface
      EP0_Write(&myUsbDevice.interfaceAltSetting[interface], 1);
#else
      // Alternate interfaces are not supported, so return 0x0000.
      EP0_Write(&txZero, 1);
#endif
      retVal = USB_STATUS_OK;
    }
  }
  return retVal;
}

/***************************************************************************//**
 * @brief       Sends the requested Remote Wakeup, Self-Powered, or
 *              Endpoint Status
 * @return      Status of request (type @ref USB_Status_TypeDef)
 * @note        This function takes no parameters, but it uses the setup command
 *              stored in @ref myUsbDevice.setup.
 ******************************************************************************/
static USB_Status_TypeDef GetStatus(void)
{
  USB_Status_TypeDef retVal = USB_STATUS_REQ_ERR;

  if ((myUsbDevice.setup.wLength == 2)
      && (myUsbDevice.setup.wValue == 0)
      && (myUsbDevice.setup.bmRequestType.Direction == USB_SETUP_DIR_IN)
      && (myUsbDevice.state >= USBD_STATE_ADDRESSED))
  {
    pStatus = htole16(0);         // Default return value is 0x0000

    switch (myUsbDevice.setup.bmRequestType.Recipient)
    {
      case USB_SETUP_RECIPIENT_DEVICE:
        if (myUsbDevice.setup.wIndex == 0)
        {
  #if SLAB_USB_REMOTE_WAKEUP_ENABLED
          // Remote wakeup feature status
          if (myUsbDevice.remoteWakeupEnabled)
          {
            pStatus |= htole16(REMOTE_WAKEUP_ENABLED);
          }
  #endif // SLAB_USB_REMOTE_WAKEUP_ENABLED

  #if SLAB_USB_IS_SELF_POWERED_CB
          // Current self/bus power status
          if (USBD_IsSelfPoweredCb())
          {
            pStatus |= htole16(DEVICE_IS_SELFPOWERED);
          }
  #elif (SLAB_USB_BUS_POWERED == 0)
          pStatus |= htole16(DEVICE_IS_SELFPOWERED);
  #endif // SLAB_USB_IS_SELF_POWERED_CB

          retVal = USB_STATUS_OK;
        }
        break;

      case USB_SETUP_RECIPIENT_INTERFACE:
        if (myUsbDevice.setup.wIndex < SLAB_USB_NUM_INTERFACES)
        {
          retVal = USB_STATUS_OK;
        }
        break;


      case USB_SETUP_RECIPIENT_ENDPOINT:
        // Device does not support halting endpoint 0, but do not give
        // an error as this is a valid request
        if (((myUsbDevice.setup.wIndex & ~USB_EP_DIR_IN) == 0)
            && (myUsbDevice.state == USBD_STATE_ADDRESSED))
        {
          retVal = USB_STATUS_OK;
        }
        else if (myUsbDevice.state == USBD_STATE_CONFIGURED)
        {
          switch (myUsbDevice.setup.wIndex & 0xFF)
          {
  #if SLAB_USB_EP1OUT_USED
            case (USB_EP_DIR_OUT | 1):
              if (myUsbDevice.ep1out.state == D_EP_HALT)
              {
                pStatus = htole16(1);
              }
              retVal = USB_STATUS_OK;
              break;
  #endif
  #if SLAB_USB_EP2OUT_USED
            case (USB_EP_DIR_OUT | 2):
              if (myUsbDevice.ep2out.state == D_EP_HALT)
              {
                pStatus = htole16(1);
              }
              retVal = USB_STATUS_OK;
              break;
  #endif
  #if SLAB_USB_EP3OUT_USED
            case (USB_EP_DIR_OUT | 3):
              if (myUsbDevice.ep3out.state == D_EP_HALT)
              {
                pStatus = htole16(1);
              }
              retVal = USB_STATUS_OK;
              break;
  #endif
  #if SLAB_USB_EP1IN_USED
            case (USB_EP_DIR_IN | 1):
              if (myUsbDevice.ep1in.state == D_EP_HALT)
              {
                pStatus = htole16(1);
              }
              retVal = USB_STATUS_OK;
              break;
  #endif
  #if SLAB_USB_EP2IN_USED
            case (USB_EP_DIR_IN | 2):
              if (myUsbDevice.ep2in.state == D_EP_HALT)
              {
                pStatus = htole16(1);
              }
              retVal = USB_STATUS_OK;
              break;
  #endif
  #if SLAB_USB_EP3IN_USED
            case (USB_EP_DIR_IN | 3):
              if (myUsbDevice.ep3in.state == D_EP_HALT)
              {
                pStatus = htole16(1);
              }
              retVal = USB_STATUS_OK;
              break;
  #endif
          }
        }
        break;
    }

