conorpp/u2f-zero/firmware/lib/efm8_usb/src/efm8_usbdch9.c
    // If the command was valid, send the requested status.
    if (retVal == USB_STATUS_OK)
    {
      EP0_Write((uint8_t *)&pStatus, 2);
    }
  }

  return retVal;
}

/***************************************************************************//**
 * @brief       Sets the Address
 * @return      Status of request (type @ref USB_Status_TypeDef)
 * @note        This function takes no parameters, but it uses the setup command
 *              stored in @ref myUsbDevice.setup.
 ******************************************************************************/
static USB_Status_TypeDef SetAddress(void)
{
  USB_Status_TypeDef retVal = USB_STATUS_REQ_ERR;

  if ((myUsbDevice.setup.wValue < 128)
      && (myUsbDevice.setup.wLength == 0)
      && (myUsbDevice.setup.bmRequestType.Recipient == USB_SETUP_RECIPIENT_DEVICE)
      && (myUsbDevice.setup.wIndex == 0))
  {
    // If the device is in the Default state and the address is non-zero, put
    // the device in the Addressed state.
    if (myUsbDevice.state == USBD_STATE_DEFAULT)
    {
      if (myUsbDevice.setup.wValue != 0)
      {
        USBD_SetUsbState(USBD_STATE_ADDRESSED);
      }
      retVal = USB_STATUS_OK;
    }
    // If the device is already addressed and the address is zero, put the
    // device in the Default state.
    else if (myUsbDevice.state == USBD_STATE_ADDRESSED)
    {
      if (myUsbDevice.setup.wValue == 0)
      {
        USBD_SetUsbState(USBD_STATE_DEFAULT);
      }
      retVal = USB_STATUS_OK;
    }

    // Set the new address if the request was valid.
    if (retVal == USB_STATUS_OK)
    {
      USB_SetAddress(myUsbDevice.setup.wValue);
    }
  }

  return retVal;
}

/***************************************************************************//**
 * @brief       Sets the Configuration
 * @return      Status of request (type @ref USB_Status_TypeDef)
 * @note        This function takes no parameters, but it uses the setup command
 *              stored in @ref myUsbDevice.setup.
 ******************************************************************************/
static USB_Status_TypeDef SetConfiguration(void)
{
  USB_Status_TypeDef retVal = USB_STATUS_REQ_ERR;

  if (((myUsbDevice.setup.wValue >> 8) == 0)
      && (myUsbDevice.setup.bmRequestType.Recipient == USB_SETUP_RECIPIENT_DEVICE)
      && (myUsbDevice.setup.wLength == 0)
      && (myUsbDevice.setup.wIndex == 0))
  {
    // If the device is in the Addressed state and a valid Configuration value
    // was sent, enter the Configured state.
    if (myUsbDevice.state == USBD_STATE_ADDRESSED)
    {
      if ((myUsbDevice.setup.wValue == 0)
          || (myUsbDevice.setup.wValue == myUsbDevice.configDescriptor->bConfigurationValue))
      {
        myUsbDevice.configurationValue = myUsbDevice.setup.wValue;
        if (myUsbDevice.setup.wValue == myUsbDevice.configDescriptor->bConfigurationValue)
        {
          USBD_ActivateAllEps(true);
          USBD_SetUsbState(USBD_STATE_CONFIGURED);
        }
        retVal = USB_STATUS_OK;
      }
    }
    // If the device is in the Configured state and Configuration zero is sent,
    // abort all transfer and enter the Addressed state.
    else if (myUsbDevice.state == USBD_STATE_CONFIGURED)
    {
      if ((myUsbDevice.setup.wValue == 0)
          || (myUsbDevice.setup.wValue == myUsbDevice.configDescriptor->bConfigurationValue))
      {
        myUsbDevice.configurationValue = myUsbDevice.setup.wValue;
        if (myUsbDevice.setup.wValue == 0)
        {
          USBD_SetUsbState(USBD_STATE_ADDRESSED);
          USBD_AbortAllTransfers();
        }
        else
        {
          // Reenable device endpoints, will reset data toggles
          USBD_ActivateAllEps(false);
        }
        retVal = USB_STATUS_OK;
      }
    }
  }

  return retVal;
}

/***************************************************************************//**
 * @brief       Sets the Remote Wakeup or Endpoint Halt Feature
 * @return      Status of request (type @ref USB_Status_TypeDef)
 * @note        This function takes no parameters, but it uses the setup command
 *              stored in @ref myUsbDevice.setup.
 ******************************************************************************/
static USB_Status_TypeDef SetFeature(void)
{
  USB_Status_TypeDef retVal = USB_STATUS_REQ_ERR;

  if (myUsbDevice.setup.wLength == 0)
  {
    switch (myUsbDevice.setup.bmRequestType.Recipient)
    {
  #if SLAB_USB_REMOTE_WAKEUP_ENABLED
      case USB_SETUP_RECIPIENT_DEVICE:
        if ((myUsbDevice.setup.wIndex == 0)     // ITF no. 0
            && (myUsbDevice.setup.wValue == USB_FEATURE_DEVICE_REMOTE_WAKEUP)
            && (myUsbDevice.state == USBD_STATE_CONFIGURED))
        {
          myUsbDevice.remoteWakeupEnabled = true;
          retVal = USB_STATUS_OK;
        }
        break;
  #endif // SLAB_USB_REMOTE_WAKEUP_ENABLED
      case USB_SETUP_RECIPIENT_ENDPOINT:
        // Device does not support halting endpoint 0, but do not return
        // an error as this is a valid request
        if (((myUsbDevice.setup.wIndex & ~USB_EP_DIR_IN) == 0)
            && (myUsbDevice.state >= USBD_STATE_ADDRESSED))
        {
          retVal = USB_STATUS_OK;
        }
        else if ((((myUsbDevice.setup.wIndex) & ~USB_SETUP_DIR_D2H) < SLAB_USB_NUM_EPS_USED)
                 && (myUsbDevice.setup.wValue == USB_FEATURE_ENDPOINT_HALT)
                 && (myUsbDevice.state == USBD_STATE_CONFIGURED))
        {
          retVal = USB_STATUS_OK;
          USB_SetIndex((myUsbDevice.setup.wIndex & 0xFF) & ~USB_SETUP_DIR_D2H);

          // Enable Stalls on the specified endpoint.
#if (SLAB_USB_EP1IN_USED || SLAB_USB_EP2IN_USED || SLAB_USB_EP3IN_USED)
          if ((myUsbDevice.setup.wIndex & 0xFF) & USB_EP_DIR_IN)
          {
            USB_EpnInStall();
          }
#endif
#if (SLAB_USB_EP1OUT_USED || SLAB_USB_EP2OUT_USED || SLAB_USB_EP3OUT_USED)
          if (((myUsbDevice.setup.wIndex & 0xFF) & USB_EP_DIR_IN) == 0)
          {
            USB_EpnOutStall();
          }
#endif

          // Put the specified endpoint in the Halted state.
          switch (myUsbDevice.setup.wIndex & 0xFF)
          {
  #if SLAB_USB_EP1OUT_USED
            case (USB_EP_DIR_OUT | 1):
              myUsbDevice.ep1out.state = D_EP_HALT;
              break;
  #endif
  #if SLAB_USB_EP2OUT_USED
            case (USB_EP_DIR_OUT | 2):
              myUsbDevice.ep2out.state = D_EP_HALT;
              break;
  #endif
  #if SLAB_USB_EP3OUT_USED
            case (USB_EP_DIR_OUT | 3):
              myUsbDevice.ep3out.state = D_EP_HALT;
              break;
  #endif
  #if SLAB_USB_EP1IN_USED
            case (USB_EP_DIR_IN | 1):
              myUsbDevice.ep1in.state = D_EP_HALT;
              break;
  #endif
  #if SLAB_USB_EP2IN_USED
            case (USB_EP_DIR_IN | 2):
              myUsbDevice.ep2in.state = D_EP_HALT;
              break;
  #endif
  #if SLAB_USB_EP3IN_USED
            case (USB_EP_DIR_IN | 3):
              myUsbDevice.ep3in.state = D_EP_HALT;
              break;
  #endif
          }
        }
    }
  }

  return retVal;
}

/***************************************************************************//**
 * @brief       Sets the Interface and Alternate Interface (if supported)
 * @return      Status of request (type @ref USB_Status_TypeDef)
 * @note        This function takes no parameters, but it uses the setup command
 *              stored in @ref myUsbDevice.setup.
 ******************************************************************************/
static USB_Status_TypeDef SetInterface(void)
{
  USB_Status_TypeDef retVal = USB_STATUS_REQ_ERR;
  uint8_t interface = (uint8_t)myUsbDevice.setup.wIndex;
  uint8_t altSetting = (uint8_t)myUsbDevice.setup.wValue;

  if ((interface < SLAB_USB_NUM_INTERFACES)
      && (myUsbDevice.state == USBD_STATE_CONFIGURED)
      && (myUsbDevice.setup.wLength == 0)
#if (SLAB_USB_SUPPORT_ALT_INTERFACES == 0)
      && (altSetting == 0)
#endif
      && (myUsbDevice.setup.bmRequestType.Recipient == USB_SETUP_RECIPIENT_INTERFACE))
  {
#if (SLAB_USB_SUPPORT_ALT_INTERFACES)
    if (USBD_SetInterfaceCb(interface, altSetting) == USB_STATUS_OK)
    {
      myUsbDevice.interfaceAltSetting[interface] = altSetting;
      retVal = USB_STATUS_OK;
    }
#else
#if (SLAB_USB_NUM_INTERFACES == 1)
    // Reset data toggles on EP's
    USBD_ActivateAllEps(false);
#endif // ( SLAB_USB_NUM_INTERFACES == 1 )
    retVal = USB_STATUS_OK;
#endif // ( SLAB_USB_SUPPORT_ALT_INTERFACES )
  }

  return retVal;
}

