conorpp/u2f-zero/firmware/lib/efm8_usb/src/efm8_usbdch9.c
// -----------------------------------------------------------------------------
// Utility Functions

/***************************************************************************//**
 * @brief       Enables all endpoints for data transfers
 * @return      Status of request (type @ref USB_Status_TypeDef)
 * @note        This function takes no parameters, but it uses the setup command
 *              stored in @ref myUsbDevice.setup.
 ******************************************************************************/
static void USBD_ActivateAllEps(bool forceIdle)
{
  if (forceIdle == true)
  {
#if SLAB_USB_EP1IN_USED
    myUsbDevice.ep1in.state = D_EP_IDLE;
#endif
#if SLAB_USB_EP2IN_USED
    myUsbDevice.ep2in.state = D_EP_IDLE;
#endif
#if SLAB_USB_EP3IN_USED
    myUsbDevice.ep3in.state = D_EP_IDLE;
#endif
#if SLAB_USB_EP1OUT_USED
    myUsbDevice.ep1out.state = D_EP_IDLE;
#endif
#if SLAB_USB_EP2OUT_USED
    myUsbDevice.ep2out.state = D_EP_IDLE;
#endif
#if SLAB_USB_EP3OUT_USED
    myUsbDevice.ep3out.state = D_EP_IDLE;
#endif
  }

#if SLAB_USB_EP1IN_USED
  USB_ActivateEp(1,                                                   // ep
                 SLAB_USB_EP1IN_MAX_PACKET_SIZE,                      // packetSize
                 1,                                                   // inDir
                 SLAB_USB_EP1OUT_USED,                                // splitMode
                 0);                                                  // isoMod
#endif // SLAB_USB_EP1IN_USED
#if SLAB_USB_EP2IN_USED
  USB_ActivateEp(2,                                                   // ep
                 SLAB_USB_EP2IN_MAX_PACKET_SIZE,                      // packetSize
                 1,                                                   // inDir
                 SLAB_USB_EP2OUT_USED,                                // splitMode
                 0);                                                  // isoMod
#endif // SLAB_USB_EP2IN_USED
#if SLAB_USB_EP3IN_USED
  USB_ActivateEp(3,                                                   // ep
                 SLAB_USB_EP3IN_MAX_PACKET_SIZE,                      // packetSize
                 1,                                                   // inDir
                 SLAB_USB_EP3OUT_USED,                                // splitMode
                 (SLAB_USB_EP3IN_TRANSFER_TYPE == USB_EPTYPE_ISOC));  // isoMod
#endif // SLAB_USB_EP3IN_USED
#if SLAB_USB_EP1OUT_USED
  USB_ActivateEp(1,                                                   // ep
                 SLAB_USB_EP1OUT_MAX_PACKET_SIZE,                     // packetSize
                 0,                                                   // inDir
                 SLAB_USB_EP1IN_USED,                                 // splitMode
                 0);                                                  // isoMod
#endif // SLAB_USB_EP1OUT_USED
#if SLAB_USB_EP2OUT_USED
  USB_ActivateEp(2,                                                   // ep
                 SLAB_USB_EP2OUT_MAX_PACKET_SIZE,                     // packetSize
                 0,                                                   // inDir
                 SLAB_USB_EP2IN_USED,                                 // splitMode
                 0);                                                  // isoMod
#endif // SLAB_USB_EP2OUT_USED
#if SLAB_USB_EP3OUT_USED
  USB_ActivateEp(3,                                                   // ep
                 SLAB_USB_EP3OUT_MAX_PACKET_SIZE,                     // packetSize
                 0,                                                   // inDir
                 SLAB_USB_EP3IN_USED,                                 // splitMode
                 (SLAB_USB_EP3OUT_TRANSFER_TYPE == USB_EPTYPE_ISOC)); // isoMod
#endif // SLAB_USB_EP1OUT_USED
}

/***************************************************************************//**
 * @brief       Sets up an Endpoint 0 Write
 * @param       dat
 *              Data to transmit on Endpoint 0
 * @param       numBytes
 *              Number of bytes to transmit on Endpoint 0
 ******************************************************************************/
static void EP0_Write(uint8_t *dat, uint16_t numBytes)
{
  if (myUsbDevice.ep0.state == D_EP_IDLE)
  {
    myUsbDevice.ep0.buf = (uint8_t *)dat;
    myUsbDevice.ep0.remaining = numBytes;
    myUsbDevice.ep0.state = D_EP_TRANSMITTING;
    myUsbDevice.ep0.misc.c = 0;
  }
}
